Revit 2018 API
TextElement.IsTextWrappingActive Property
 A flag identifying whether text-wrapping is currently active in this text element or not.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Since: 2016
Syntax
C#
public bool IsTextWrappingActive { get; }
Visual Basic
Public ReadOnly Property IsTextWrappingActive As Boolean
	Get
Visual C++
public:
property bool IsTextWrappingActive {
	bool get ();
}
Remarks
This is currently a read-only property and its value is set when the text element is created. If the element was created with a specified width or if an explicit width was set later, the wrapping would be automatically set as active. It means that any text line that is longer that the current width of the text-box will automatically wrapped onto the next line.
See Also
TextElement Class
Autodesk.Revit.DB Namespace